MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4700-F100K2048/mcu.h
/* ------------------------------  GPDMA1_RAWDSTTRAN  ----------------------------- */
#define GPDMA1_RAWDSTTRAN_CH0_Pos             (0UL)                     /*!< GPDMA1 RAWDSTTRAN: CH0 (Bit 0)                              */
#define GPDMA1_RAWDSTTRAN_CH0_Msk             (0x1UL)                   /*!< GPDMA1 RAWDSTTRAN: CH0 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWDSTTRAN_CH1_Pos             (1UL)                     /*!< GPDMA1 RAWDSTTRAN: CH1 (Bit 1)                              */
#define GPDMA1_RAWDSTTRAN_CH1_Msk             (0x2UL)                   /*!< GPDMA1 RAWDSTTRAN: CH1 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWDSTTRAN_CH2_Pos             (2UL)                     /*!< GPDMA1 RAWDSTTRAN: CH2 (Bit 2)                              */
#define GPDMA1_RAWDSTTRAN_CH2_Msk             (0x4UL)                   /*!< GPDMA1 RAWDSTTRAN: CH2 (Bitfield-Mask: 0x01)                */
#define GPDMA1_RAWDSTTRAN_CH3_Pos             (3UL)                     /*!< GPDMA1 RAWDSTTRAN: CH3 (Bit 3)                              */
#define GPDMA1_RAWDSTTRAN_CH3_Msk             (0x8UL)                   /*!< GPDMA1 RAWDSTTRAN: CH3 (Bitfield-Mask: 0x01)                */

/* --------------------------------  GPDMA1_RAWERR  ------------------------------- */
#define GPDMA1_RAWERR_CH0_Pos                 (0UL)                     /*!< GPDMA1 RAWERR: CH0 (Bit 0)                                  */
#define GPDMA1_RAWERR_CH0_Msk                 (0x1UL)                   /*!< GPDMA1 RAWERR: CH0 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWERR_CH1_Pos                 (1UL)                     /*!< GPDMA1 RAWERR: CH1 (Bit 1)                                  */
#define GPDMA1_RAWERR_CH1_Msk                 (0x2UL)                   /*!< GPDMA1 RAWERR: CH1 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWERR_CH2_Pos                 (2UL)                     /*!< GPDMA1 RAWERR: CH2 (Bit 2)                                  */
#define GPDMA1_RAWERR_CH2_Msk                 (0x4UL)                   /*!< GPDMA1 RAWERR: CH2 (Bitfield-Mask: 0x01)                    */
#define GPDMA1_RAWERR_CH3_Pos                 (3UL)                     /*!< GPDMA1 RAWERR: CH3 (Bit 3)                                  */
#define GPDMA1_RAWERR_CH3_Msk                 (0x8UL)                   /*!< GPDMA1 RAWERR: CH3 (Bitfield-Mask: 0x01)                    */

/* ------------------------------  GPDMA1_STATUSTFR  ------------------------------ */
#define GPDMA1_STATUSTFR_CH0_Pos              (0UL)                     /*!< GPDMA1 STATUSTFR: CH0 (Bit 0)                               */
#define GPDMA1_STATUSTFR_CH0_Msk              (0x1UL)                   /*!< GPDMA1 STATUSTFR: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSTFR_CH1_Pos              (1UL)                     /*!< GPDMA1 STATUSTFR: CH1 (Bit 1)                               */
#define GPDMA1_STATUSTFR_CH1_Msk              (0x2UL)                   /*!< GPDMA1 STATUSTFR: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSTFR_CH2_Pos              (2UL)                     /*!< GPDMA1 STATUSTFR: CH2 (Bit 2)                               */
#define GPDMA1_STATUSTFR_CH2_Msk              (0x4UL)                   /*!< GPDMA1 STATUSTFR: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSTFR_CH3_Pos              (3UL)                     /*!< GPDMA1 STATUSTFR: CH3 (Bit 3)                               */
#define GPDMA1_STATUSTFR_CH3_Msk              (0x8UL)                   /*!< GPDMA1 STATUSTFR: CH3 (Bitfield-Mask: 0x01)                 */

/* -----------------------------  GPDMA1_STATUSBLOCK  ----------------------------- */
#define GPDMA1_STATUSBLOCK_CH0_Pos            (0UL)                     /*!< GPDMA1 STATUSBLOCK: CH0 (Bit 0)                             */
#define GPDMA1_STATUSBLOCK_CH0_Msk            (0x1UL)                   /*!< GPDMA1 STATUSBLOCK: CH0 (Bitfield-Mask: 0x01)               */
#define GPDMA1_STATUSBLOCK_CH1_Pos            (1UL)                     /*!< GPDMA1 STATUSBLOCK: CH1 (Bit 1)                             */
#define GPDMA1_STATUSBLOCK_CH1_Msk            (0x2UL)                   /*!< GPDMA1 STATUSBLOCK: CH1 (Bitfield-Mask: 0x01)               */
#define GPDMA1_STATUSBLOCK_CH2_Pos            (2UL)                     /*!< GPDMA1 STATUSBLOCK: CH2 (Bit 2)                             */
#define GPDMA1_STATUSBLOCK_CH2_Msk            (0x4UL)                   /*!< GPDMA1 STATUSBLOCK: CH2 (Bitfield-Mask: 0x01)               */
#define GPDMA1_STATUSBLOCK_CH3_Pos            (3UL)                     /*!< GPDMA1 STATUSBLOCK: CH3 (Bit 3)                             */
#define GPDMA1_STATUSBLOCK_CH3_Msk            (0x8UL)                   /*!< GPDMA1 STATUSBLOCK: CH3 (Bitfield-Mask: 0x01)               */

/* ----------------------------  GPDMA1_STATUSSRCTRAN  ---------------------------- */
#define GPDMA1_STATUSSRCTRAN_CH0_Pos          (0UL)                     /*!< GPDMA1 STATUSSRCTRAN: CH0 (Bit 0)                           */
#define GPDMA1_STATUSSRCTRAN_CH0_Msk          (0x1UL)                   /*!< GPDMA1 STATUSSRCTRAN: CH0 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSSRCTRAN_CH1_Pos          (1UL)                     /*!< GPDMA1 STATUSSRCTRAN: CH1 (Bit 1)                           */
#define GPDMA1_STATUSSRCTRAN_CH1_Msk          (0x2UL)                   /*!< GPDMA1 STATUSSRCTRAN: CH1 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSSRCTRAN_CH2_Pos          (2UL)                     /*!< GPDMA1 STATUSSRCTRAN: CH2 (Bit 2)                           */
#define GPDMA1_STATUSSRCTRAN_CH2_Msk          (0x4UL)                   /*!< GPDMA1 STATUSSRCTRAN: CH2 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSSRCTRAN_CH3_Pos          (3UL)                     /*!< GPDMA1 STATUSSRCTRAN: CH3 (Bit 3)                           */
#define GPDMA1_STATUSSRCTRAN_CH3_Msk          (0x8UL)                   /*!< GPDMA1 STATUSSRCTRAN: CH3 (Bitfield-Mask: 0x01)             */

/* ----------------------------  GPDMA1_STATUSDSTTRAN  ---------------------------- */
#define GPDMA1_STATUSDSTTRAN_CH0_Pos          (0UL)                     /*!< GPDMA1 STATUSDSTTRAN: CH0 (Bit 0)                           */
#define GPDMA1_STATUSDSTTRAN_CH0_Msk          (0x1UL)                   /*!< GPDMA1 STATUSDSTTRAN: CH0 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSDSTTRAN_CH1_Pos          (1UL)                     /*!< GPDMA1 STATUSDSTTRAN: CH1 (Bit 1)                           */
#define GPDMA1_STATUSDSTTRAN_CH1_Msk          (0x2UL)                   /*!< GPDMA1 STATUSDSTTRAN: CH1 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSDSTTRAN_CH2_Pos          (2UL)                     /*!< GPDMA1 STATUSDSTTRAN: CH2 (Bit 2)                           */
#define GPDMA1_STATUSDSTTRAN_CH2_Msk          (0x4UL)                   /*!< GPDMA1 STATUSDSTTRAN: CH2 (Bitfield-Mask: 0x01)             */
#define GPDMA1_STATUSDSTTRAN_CH3_Pos          (3UL)                     /*!< GPDMA1 STATUSDSTTRAN: CH3 (Bit 3)                           */
#define GPDMA1_STATUSDSTTRAN_CH3_Msk          (0x8UL)                   /*!< GPDMA1 STATUSDSTTRAN: CH3 (Bitfield-Mask: 0x01)             */

/* ------------------------------  GPDMA1_STATUSERR  ------------------------------ */
#define GPDMA1_STATUSERR_CH0_Pos              (0UL)                     /*!< GPDMA1 STATUSERR: CH0 (Bit 0)                               */
#define GPDMA1_STATUSERR_CH0_Msk              (0x1UL)                   /*!< GPDMA1 STATUSERR: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSERR_CH1_Pos              (1UL)                     /*!< GPDMA1 STATUSERR: CH1 (Bit 1)                               */
#define GPDMA1_STATUSERR_CH1_Msk              (0x2UL)                   /*!< GPDMA1 STATUSERR: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSERR_CH2_Pos              (2UL)                     /*!< GPDMA1 STATUSERR: CH2 (Bit 2)                               */
#define GPDMA1_STATUSERR_CH2_Msk              (0x4UL)                   /*!< GPDMA1 STATUSERR: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSERR_CH3_Pos              (3UL)                     /*!< GPDMA1 STATUSERR: CH3 (Bit 3)                               */
#define GPDMA1_STATUSERR_CH3_Msk              (0x8UL)                   /*!< GPDMA1 STATUSERR: CH3 (Bitfield-Mask: 0x01)                 */

/* -------------------------------  GPDMA1_MASKTFR  ------------------------------- */
#define GPDMA1_MASKTFR_CH0_Pos                (0UL)                     /*!< GPDMA1 MASKTFR: CH0 (Bit 0)                                 */
#define GPDMA1_MASKTFR_CH0_Msk                (0x1UL)                   /*!< GPDMA1 MASKTFR: CH0 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKTFR_CH1_Pos                (1UL)                     /*!< GPDMA1 MASKTFR: CH1 (Bit 1)                                 */
#define GPDMA1_MASKTFR_CH1_Msk                (0x2UL)                   /*!< GPDMA1 MASKTFR: CH1 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKTFR_CH2_Pos                (2UL)                     /*!< GPDMA1 MASKTFR: CH2 (Bit 2)                                 */
#define GPDMA1_MASKTFR_CH2_Msk                (0x4UL)                   /*!< GPDMA1 MASKTFR: CH2 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKTFR_CH3_Pos                (3UL)                     /*!< GPDMA1 MASKTFR: CH3 (Bit 3)                                 */
#define GPDMA1_MASKTFR_CH3_Msk                (0x8UL)                   /*!< GPDMA1 MASKTFR: CH3 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKTFR_WE_CH0_Pos             (8UL)                     /*!< GPDMA1 MASKTFR: WE_CH0 (Bit 8)                              */
#define GPDMA1_MASKTFR_WE_CH0_Msk             (0x100UL)                 /*!< GPDMA1 MASKTFR: WE_CH0 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKTFR_WE_CH1_Pos             (9UL)                     /*!< GPDMA1 MASKTFR: WE_CH1 (Bit 9)                              */
#define GPDMA1_MASKTFR_WE_CH1_Msk             (0x200UL)                 /*!< GPDMA1 MASKTFR: WE_CH1 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKTFR_WE_CH2_Pos             (10UL)                    /*!< GPDMA1 MASKTFR: WE_CH2 (Bit 10)                             */
#define GPDMA1_MASKTFR_WE_CH2_Msk             (0x400UL)                 /*!< GPDMA1 MASKTFR: WE_CH2 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKTFR_WE_CH3_Pos             (11UL)                    /*!< GPDMA1 MASKTFR: WE_CH3 (Bit 11)                             */
#define GPDMA1_MASKTFR_WE_CH3_Msk             (0x800UL)                 /*!< GPDMA1 MASKTFR: WE_CH3 (Bitfield-Mask: 0x01)                */

/* ------------------------------  GPDMA1_MASKBLOCK  ------------------------------ */
#define GPDMA1_MASKBLOCK_CH0_Pos              (0UL)                     /*!< GPDMA1 MASKBLOCK: CH0 (Bit 0)                               */
#define GPDMA1_MASKBLOCK_CH0_Msk              (0x1UL)                   /*!< GPDMA1 MASKBLOCK: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_MASKBLOCK_CH1_Pos              (1UL)                     /*!< GPDMA1 MASKBLOCK: CH1 (Bit 1)                               */
#define GPDMA1_MASKBLOCK_CH1_Msk              (0x2UL)                   /*!< GPDMA1 MASKBLOCK: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_MASKBLOCK_CH2_Pos              (2UL)                     /*!< GPDMA1 MASKBLOCK: CH2 (Bit 2)                               */
#define GPDMA1_MASKBLOCK_CH2_Msk              (0x4UL)                   /*!< GPDMA1 MASKBLOCK: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_MASKBLOCK_CH3_Pos              (3UL)                     /*!< GPDMA1 MASKBLOCK: CH3 (Bit 3)                               */
#define GPDMA1_MASKBLOCK_CH3_Msk              (0x8UL)                   /*!< GPDMA1 MASKBLOCK: CH3 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_MASKBLOCK_WE_CH0_Pos           (8UL)                     /*!< GPDMA1 MASKBLOCK: WE_CH0 (Bit 8)                            */
#define GPDMA1_MASKBLOCK_WE_CH0_Msk           (0x100UL)                 /*!< GPDMA1 MASKBLOCK: WE_CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_MASKBLOCK_WE_CH1_Pos           (9UL)                     /*!< GPDMA1 MASKBLOCK: WE_CH1 (Bit 9)                            */
#define GPDMA1_MASKBLOCK_WE_CH1_Msk           (0x200UL)                 /*!< GPDMA1 MASKBLOCK: WE_CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_MASKBLOCK_WE_CH2_Pos           (10UL)                    /*!< GPDMA1 MASKBLOCK: WE_CH2 (Bit 10)                           */
#define GPDMA1_MASKBLOCK_WE_CH2_Msk           (0x400UL)                 /*!< GPDMA1 MASKBLOCK: WE_CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_MASKBLOCK_WE_CH3_Pos           (11UL)                    /*!< GPDMA1 MASKBLOCK: WE_CH3 (Bit 11)                           */
#define GPDMA1_MASKBLOCK_WE_CH3_Msk           (0x800UL)                 /*!< GPDMA1 MASKBLOCK: WE_CH3 (Bitfield-Mask: 0x01)              */

/* -----------------------------  GPDMA1_MASKSRCTRAN  ----------------------------- */
#define GPDMA1_MASKSRCTRAN_CH0_Pos            (0UL)                     /*!< GPDMA1 MASKSRCTRAN: CH0 (Bit 0)                             */
#define GPDMA1_MASKSRCTRAN_CH0_Msk            (0x1UL)                   /*!< GPDMA1 MASKSRCTRAN: CH0 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKSRCTRAN_CH1_Pos            (1UL)                     /*!< GPDMA1 MASKSRCTRAN: CH1 (Bit 1)                             */
#define GPDMA1_MASKSRCTRAN_CH1_Msk            (0x2UL)                   /*!< GPDMA1 MASKSRCTRAN: CH1 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKSRCTRAN_CH2_Pos            (2UL)                     /*!< GPDMA1 MASKSRCTRAN: CH2 (Bit 2)                             */
#define GPDMA1_MASKSRCTRAN_CH2_Msk            (0x4UL)                   /*!< GPDMA1 MASKSRCTRAN: CH2 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKSRCTRAN_CH3_Pos            (3UL)                     /*!< GPDMA1 MASKSRCTRAN: CH3 (Bit 3)                             */
#define GPDMA1_MASKSRCTRAN_CH3_Msk            (0x8UL)                   /*!< GPDMA1 MASKSRCTRAN: CH3 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKSRCTRAN_WE_CH0_Pos         (8UL)                     /*!< GPDMA1 MASKSRCTRAN: WE_CH0 (Bit 8)                          */
#define GPDMA1_MASKSRCTRAN_WE_CH0_Msk         (0x100UL)                 /*!< GPDMA1 MASKSRCTRAN: WE_CH0 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKSRCTRAN_WE_CH1_Pos         (9UL)                     /*!< GPDMA1 MASKSRCTRAN: WE_CH1 (Bit 9)                          */
#define GPDMA1_MASKSRCTRAN_WE_CH1_Msk         (0x200UL)                 /*!< GPDMA1 MASKSRCTRAN: WE_CH1 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKSRCTRAN_WE_CH2_Pos         (10UL)                    /*!< GPDMA1 MASKSRCTRAN: WE_CH2 (Bit 10)                         */
#define GPDMA1_MASKSRCTRAN_WE_CH2_Msk         (0x400UL)                 /*!< GPDMA1 MASKSRCTRAN: WE_CH2 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKSRCTRAN_WE_CH3_Pos         (11UL)                    /*!< GPDMA1 MASKSRCTRAN: WE_CH3 (Bit 11)                         */
#define GPDMA1_MASKSRCTRAN_WE_CH3_Msk         (0x800UL)                 /*!< GPDMA1 MASKSRCTRAN: WE_CH3 (Bitfield-Mask: 0x01)            */

/* -----------------------------  GPDMA1_MASKDSTTRAN  ----------------------------- */
#define GPDMA1_MASKDSTTRAN_CH0_Pos            (0UL)                     /*!< GPDMA1 MASKDSTTRAN: CH0 (Bit 0)                             */
#define GPDMA1_MASKDSTTRAN_CH0_Msk            (0x1UL)                   /*!< GPDMA1 MASKDSTTRAN: CH0 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKDSTTRAN_CH1_Pos            (1UL)                     /*!< GPDMA1 MASKDSTTRAN: CH1 (Bit 1)                             */
#define GPDMA1_MASKDSTTRAN_CH1_Msk            (0x2UL)                   /*!< GPDMA1 MASKDSTTRAN: CH1 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKDSTTRAN_CH2_Pos            (2UL)                     /*!< GPDMA1 MASKDSTTRAN: CH2 (Bit 2)                             */
#define GPDMA1_MASKDSTTRAN_CH2_Msk            (0x4UL)                   /*!< GPDMA1 MASKDSTTRAN: CH2 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKDSTTRAN_CH3_Pos            (3UL)                     /*!< GPDMA1 MASKDSTTRAN: CH3 (Bit 3)                             */
#define GPDMA1_MASKDSTTRAN_CH3_Msk            (0x8UL)                   /*!< GPDMA1 MASKDSTTRAN: CH3 (Bitfield-Mask: 0x01)               */
#define GPDMA1_MASKDSTTRAN_WE_CH0_Pos         (8UL)                     /*!< GPDMA1 MASKDSTTRAN: WE_CH0 (Bit 8)                          */
#define GPDMA1_MASKDSTTRAN_WE_CH0_Msk         (0x100UL)                 /*!< GPDMA1 MASKDSTTRAN: WE_CH0 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKDSTTRAN_WE_CH1_Pos         (9UL)                     /*!< GPDMA1 MASKDSTTRAN: WE_CH1 (Bit 9)                          */
#define GPDMA1_MASKDSTTRAN_WE_CH1_Msk         (0x200UL)                 /*!< GPDMA1 MASKDSTTRAN: WE_CH1 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKDSTTRAN_WE_CH2_Pos         (10UL)                    /*!< GPDMA1 MASKDSTTRAN: WE_CH2 (Bit 10)                         */
#define GPDMA1_MASKDSTTRAN_WE_CH2_Msk         (0x400UL)                 /*!< GPDMA1 MASKDSTTRAN: WE_CH2 (Bitfield-Mask: 0x01)            */
#define GPDMA1_MASKDSTTRAN_WE_CH3_Pos         (11UL)                    /*!< GPDMA1 MASKDSTTRAN: WE_CH3 (Bit 11)                         */
#define GPDMA1_MASKDSTTRAN_WE_CH3_Msk         (0x800UL)                 /*!< GPDMA1 MASKDSTTRAN: WE_CH3 (Bitfield-Mask: 0x01)            */

/* -------------------------------  GPDMA1_MASKERR  ------------------------------- */
#define GPDMA1_MASKERR_CH0_Pos                (0UL)                     /*!< GPDMA1 MASKERR: CH0 (Bit 0)                                 */
#define GPDMA1_MASKERR_CH0_Msk                (0x1UL)                   /*!< GPDMA1 MASKERR: CH0 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKERR_CH1_Pos                (1UL)                     /*!< GPDMA1 MASKERR: CH1 (Bit 1)                                 */
#define GPDMA1_MASKERR_CH1_Msk                (0x2UL)                   /*!< GPDMA1 MASKERR: CH1 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKERR_CH2_Pos                (2UL)                     /*!< GPDMA1 MASKERR: CH2 (Bit 2)                                 */
#define GPDMA1_MASKERR_CH2_Msk                (0x4UL)                   /*!< GPDMA1 MASKERR: CH2 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKERR_CH3_Pos                (3UL)                     /*!< GPDMA1 MASKERR: CH3 (Bit 3)                                 */
#define GPDMA1_MASKERR_CH3_Msk                (0x8UL)                   /*!< GPDMA1 MASKERR: CH3 (Bitfield-Mask: 0x01)                   */
#define GPDMA1_MASKERR_WE_CH0_Pos             (8UL)                     /*!< GPDMA1 MASKERR: WE_CH0 (Bit 8)                              */
#define GPDMA1_MASKERR_WE_CH0_Msk             (0x100UL)                 /*!< GPDMA1 MASKERR: WE_CH0 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKERR_WE_CH1_Pos             (9UL)                     /*!< GPDMA1 MASKERR: WE_CH1 (Bit 9)                              */
#define GPDMA1_MASKERR_WE_CH1_Msk             (0x200UL)                 /*!< GPDMA1 MASKERR: WE_CH1 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKERR_WE_CH2_Pos             (10UL)                    /*!< GPDMA1 MASKERR: WE_CH2 (Bit 10)                             */
#define GPDMA1_MASKERR_WE_CH2_Msk             (0x400UL)                 /*!< GPDMA1 MASKERR: WE_CH2 (Bitfield-Mask: 0x01)                */
#define GPDMA1_MASKERR_WE_CH3_Pos             (11UL)                    /*!< GPDMA1 MASKERR: WE_CH3 (Bit 11)                             */
#define GPDMA1_MASKERR_WE_CH3_Msk             (0x800UL)                 /*!< GPDMA1 MASKERR: WE_CH3 (Bitfield-Mask: 0x01)                */

/* -------------------------------  GPDMA1_CLEARTFR  ------------------------------ */
#define GPDMA1_CLEARTFR_CH0_Pos               (0UL)                     /*!< GPDMA1 CLEARTFR: CH0 (Bit 0)                                */
#define GPDMA1_CLEARTFR_CH0_Msk               (0x1UL)                   /*!< GPDMA1 CLEARTFR: CH0 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARTFR_CH1_Pos               (1UL)                     /*!< GPDMA1 CLEARTFR: CH1 (Bit 1)                                */
#define GPDMA1_CLEARTFR_CH1_Msk               (0x2UL)                   /*!< GPDMA1 CLEARTFR: CH1 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARTFR_CH2_Pos               (2UL)                     /*!< GPDMA1 CLEARTFR: CH2 (Bit 2)                                */
#define GPDMA1_CLEARTFR_CH2_Msk               (0x4UL)                   /*!< GPDMA1 CLEARTFR: CH2 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARTFR_CH3_Pos               (3UL)                     /*!< GPDMA1 CLEARTFR: CH3 (Bit 3)                                */
#define GPDMA1_CLEARTFR_CH3_Msk               (0x8UL)                   /*!< GPDMA1 CLEARTFR: CH3 (Bitfield-Mask: 0x01)                  */

/* ------------------------------  GPDMA1_CLEARBLOCK  ----------------------------- */
#define GPDMA1_CLEARBLOCK_CH0_Pos             (0UL)                     /*!< GPDMA1 CLEARBLOCK: CH0 (Bit 0)                              */
#define GPDMA1_CLEARBLOCK_CH0_Msk             (0x1UL)                   /*!< GPDMA1 CLEARBLOCK: CH0 (Bitfield-Mask: 0x01)                */
#define GPDMA1_CLEARBLOCK_CH1_Pos             (1UL)                     /*!< GPDMA1 CLEARBLOCK: CH1 (Bit 1)                              */
#define GPDMA1_CLEARBLOCK_CH1_Msk             (0x2UL)                   /*!< GPDMA1 CLEARBLOCK: CH1 (Bitfield-Mask: 0x01)                */
#define GPDMA1_CLEARBLOCK_CH2_Pos             (2UL)                     /*!< GPDMA1 CLEARBLOCK: CH2 (Bit 2)                              */
#define GPDMA1_CLEARBLOCK_CH2_Msk             (0x4UL)                   /*!< GPDMA1 CLEARBLOCK: CH2 (Bitfield-Mask: 0x01)                */
#define GPDMA1_CLEARBLOCK_CH3_Pos             (3UL)                     /*!< GPDMA1 CLEARBLOCK: CH3 (Bit 3)                              */
#define GPDMA1_CLEARBLOCK_CH3_Msk             (0x8UL)                   /*!< GPDMA1 CLEARBLOCK: CH3 (Bitfield-Mask: 0x01)                */

