MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4700-F100K2048/mcu.h
/* ----------------------------------  GPDMA1_ID  --------------------------------- */
#define GPDMA1_ID_VALUE_Pos                   (0UL)                     /*!< GPDMA1 ID: VALUE (Bit 0)                                    */
#define GPDMA1_ID_VALUE_Msk                   (0xffffffffUL)            /*!< GPDMA1 ID: VALUE (Bitfield-Mask: 0xffffffff)                */

/* ---------------------------------  GPDMA1_TYPE  -------------------------------- */
#define GPDMA1_TYPE_VALUE_Pos                 (0UL)                     /*!< GPDMA1 TYPE: VALUE (Bit 0)                                  */
#define GPDMA1_TYPE_VALUE_Msk                 (0xffffffffUL)            /*!< GPDMA1 TYPE: VALUE (Bitfield-Mask: 0xffffffff)              */

/* -------------------------------  GPDMA1_VERSION  ------------------------------- */
#define GPDMA1_VERSION_VALUE_Pos              (0UL)                     /*!< GPDMA1 VERSION: VALUE (Bit 0)                               */
#define GPDMA1_VERSION_VALUE_Msk              (0xffffffffUL)            /*!< GPDMA1 VERSION: VALUE (Bitfield-Mask: 0xffffffff)           */


/* ================================================================================ */
/* ================        Group 'GPDMA1_CH' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------------  GPDMA1_CH_SAR  ------------------------------- */
#define GPDMA1_CH_SAR_SAR_Pos                 (0UL)                     /*!< GPDMA1_CH SAR: SAR (Bit 0)                                  */
#define GPDMA1_CH_SAR_SAR_Msk                 (0xffffffffUL)            /*!< GPDMA1_CH SAR: SAR (Bitfield-Mask: 0xffffffff)              */

/* --------------------------------  GPDMA1_CH_DAR  ------------------------------- */
#define GPDMA1_CH_DAR_DAR_Pos                 (0UL)                     /*!< GPDMA1_CH DAR: DAR (Bit 0)                                  */
#define GPDMA1_CH_DAR_DAR_Msk                 (0xffffffffUL)            /*!< GPDMA1_CH DAR: DAR (Bitfield-Mask: 0xffffffff)              */

/* -------------------------------  GPDMA1_CH_CTLL  ------------------------------- */
#define GPDMA1_CH_CTLL_INT_EN_Pos             (0UL)                     /*!< GPDMA1_CH CTLL: INT_EN (Bit 0)                              */
#define GPDMA1_CH_CTLL_INT_EN_Msk             (0x1UL)                   /*!< GPDMA1_CH CTLL: INT_EN (Bitfield-Mask: 0x01)                */
#define GPDMA1_CH_CTLL_DST_TR_WIDTH_Pos       (1UL)                     /*!< GPDMA1_CH CTLL: DST_TR_WIDTH (Bit 1)                        */
#define GPDMA1_CH_CTLL_DST_TR_WIDTH_Msk       (0xeUL)                   /*!< GPDMA1_CH CTLL: DST_TR_WIDTH (Bitfield-Mask: 0x07)          */
#define GPDMA1_CH_CTLL_SRC_TR_WIDTH_Pos       (4UL)                     /*!< GPDMA1_CH CTLL: SRC_TR_WIDTH (Bit 4)                        */
#define GPDMA1_CH_CTLL_SRC_TR_WIDTH_Msk       (0x70UL)                  /*!< GPDMA1_CH CTLL: SRC_TR_WIDTH (Bitfield-Mask: 0x07)          */
#define GPDMA1_CH_CTLL_DINC_Pos               (7UL)                     /*!< GPDMA1_CH CTLL: DINC (Bit 7)                                */
#define GPDMA1_CH_CTLL_DINC_Msk               (0x180UL)                 /*!< GPDMA1_CH CTLL: DINC (Bitfield-Mask: 0x03)                  */
#define GPDMA1_CH_CTLL_SINC_Pos               (9UL)                     /*!< GPDMA1_CH CTLL: SINC (Bit 9)                                */
#define GPDMA1_CH_CTLL_SINC_Msk               (0x600UL)                 /*!< GPDMA1_CH CTLL: SINC (Bitfield-Mask: 0x03)                  */
#define GPDMA1_CH_CTLL_DEST_MSIZE_Pos         (11UL)                    /*!< GPDMA1_CH CTLL: DEST_MSIZE (Bit 11)                         */
#define GPDMA1_CH_CTLL_DEST_MSIZE_Msk         (0x3800UL)                /*!< GPDMA1_CH CTLL: DEST_MSIZE (Bitfield-Mask: 0x07)            */
#define GPDMA1_CH_CTLL_SRC_MSIZE_Pos          (14UL)                    /*!< GPDMA1_CH CTLL: SRC_MSIZE (Bit 14)                          */
#define GPDMA1_CH_CTLL_SRC_MSIZE_Msk          (0x1c000UL)               /*!< GPDMA1_CH CTLL: SRC_MSIZE (Bitfield-Mask: 0x07)             */
#define GPDMA1_CH_CTLL_TT_FC_Pos              (20UL)                    /*!< GPDMA1_CH CTLL: TT_FC (Bit 20)                              */
#define GPDMA1_CH_CTLL_TT_FC_Msk              (0x700000UL)              /*!< GPDMA1_CH CTLL: TT_FC (Bitfield-Mask: 0x07)                 */

/* -------------------------------  GPDMA1_CH_CTLH  ------------------------------- */
#define GPDMA1_CH_CTLH_BLOCK_TS_Pos           (0UL)                     /*!< GPDMA1_CH CTLH: BLOCK_TS (Bit 0)                            */
#define GPDMA1_CH_CTLH_BLOCK_TS_Msk           (0xfffUL)                 /*!< GPDMA1_CH CTLH: BLOCK_TS (Bitfield-Mask: 0xfff)             */
#define GPDMA1_CH_CTLH_DONE_Pos               (12UL)                    /*!< GPDMA1_CH CTLH: DONE (Bit 12)                               */
#define GPDMA1_CH_CTLH_DONE_Msk               (0x1000UL)                /*!< GPDMA1_CH CTLH: DONE (Bitfield-Mask: 0x01)                  */

/* -------------------------------  GPDMA1_CH_CFGL  ------------------------------- */
#define GPDMA1_CH_CFGL_CH_PRIOR_Pos           (5UL)                     /*!< GPDMA1_CH CFGL: CH_PRIOR (Bit 5)                            */
#define GPDMA1_CH_CFGL_CH_PRIOR_Msk           (0xe0UL)                  /*!< GPDMA1_CH CFGL: CH_PRIOR (Bitfield-Mask: 0x07)              */
#define GPDMA1_CH_CFGL_CH_SUSP_Pos            (8UL)                     /*!< GPDMA1_CH CFGL: CH_SUSP (Bit 8)                             */
#define GPDMA1_CH_CFGL_CH_SUSP_Msk            (0x100UL)                 /*!< GPDMA1_CH CFGL: CH_SUSP (Bitfield-Mask: 0x01)               */
#define GPDMA1_CH_CFGL_FIFO_EMPTY_Pos         (9UL)                     /*!< GPDMA1_CH CFGL: FIFO_EMPTY (Bit 9)                          */
#define GPDMA1_CH_CFGL_FIFO_EMPTY_Msk         (0x200UL)                 /*!< GPDMA1_CH CFGL: FIFO_EMPTY (Bitfield-Mask: 0x01)            */
#define GPDMA1_CH_CFGL_HS_SEL_DST_Pos         (10UL)                    /*!< GPDMA1_CH CFGL: HS_SEL_DST (Bit 10)                         */
#define GPDMA1_CH_CFGL_HS_SEL_DST_Msk         (0x400UL)                 /*!< GPDMA1_CH CFGL: HS_SEL_DST (Bitfield-Mask: 0x01)            */
#define GPDMA1_CH_CFGL_HS_SEL_SRC_Pos         (11UL)                    /*!< GPDMA1_CH CFGL: HS_SEL_SRC (Bit 11)                         */
#define GPDMA1_CH_CFGL_HS_SEL_SRC_Msk         (0x800UL)                 /*!< GPDMA1_CH CFGL: HS_SEL_SRC (Bitfield-Mask: 0x01)            */
#define GPDMA1_CH_CFGL_LOCK_CH_L_Pos          (12UL)                    /*!< GPDMA1_CH CFGL: LOCK_CH_L (Bit 12)                          */
#define GPDMA1_CH_CFGL_LOCK_CH_L_Msk          (0x3000UL)                /*!< GPDMA1_CH CFGL: LOCK_CH_L (Bitfield-Mask: 0x03)             */
#define GPDMA1_CH_CFGL_LOCK_B_L_Pos           (14UL)                    /*!< GPDMA1_CH CFGL: LOCK_B_L (Bit 14)                           */
#define GPDMA1_CH_CFGL_LOCK_B_L_Msk           (0xc000UL)                /*!< GPDMA1_CH CFGL: LOCK_B_L (Bitfield-Mask: 0x03)              */
#define GPDMA1_CH_CFGL_LOCK_CH_Pos            (16UL)                    /*!< GPDMA1_CH CFGL: LOCK_CH (Bit 16)                            */
#define GPDMA1_CH_CFGL_LOCK_CH_Msk            (0x10000UL)               /*!< GPDMA1_CH CFGL: LOCK_CH (Bitfield-Mask: 0x01)               */
#define GPDMA1_CH_CFGL_LOCK_B_Pos             (17UL)                    /*!< GPDMA1_CH CFGL: LOCK_B (Bit 17)                             */
#define GPDMA1_CH_CFGL_LOCK_B_Msk             (0x20000UL)               /*!< GPDMA1_CH CFGL: LOCK_B (Bitfield-Mask: 0x01)                */
#define GPDMA1_CH_CFGL_DST_HS_POL_Pos         (18UL)                    /*!< GPDMA1_CH CFGL: DST_HS_POL (Bit 18)                         */
#define GPDMA1_CH_CFGL_DST_HS_POL_Msk         (0x40000UL)               /*!< GPDMA1_CH CFGL: DST_HS_POL (Bitfield-Mask: 0x01)            */
#define GPDMA1_CH_CFGL_SRC_HS_POL_Pos         (19UL)                    /*!< GPDMA1_CH CFGL: SRC_HS_POL (Bit 19)                         */
#define GPDMA1_CH_CFGL_SRC_HS_POL_Msk         (0x80000UL)               /*!< GPDMA1_CH CFGL: SRC_HS_POL (Bitfield-Mask: 0x01)            */
#define GPDMA1_CH_CFGL_MAX_ABRST_Pos          (20UL)                    /*!< GPDMA1_CH CFGL: MAX_ABRST (Bit 20)                          */
#define GPDMA1_CH_CFGL_MAX_ABRST_Msk          (0x3ff00000UL)            /*!< GPDMA1_CH CFGL: MAX_ABRST (Bitfield-Mask: 0x3ff)            */

/* -------------------------------  GPDMA1_CH_CFGH  ------------------------------- */
#define GPDMA1_CH_CFGH_FCMODE_Pos             (0UL)                     /*!< GPDMA1_CH CFGH: FCMODE (Bit 0)                              */
#define GPDMA1_CH_CFGH_FCMODE_Msk             (0x1UL)                   /*!< GPDMA1_CH CFGH: FCMODE (Bitfield-Mask: 0x01)                */
#define GPDMA1_CH_CFGH_FIFO_MODE_Pos          (1UL)                     /*!< GPDMA1_CH CFGH: FIFO_MODE (Bit 1)                           */
#define GPDMA1_CH_CFGH_FIFO_MODE_Msk          (0x2UL)                   /*!< GPDMA1_CH CFGH: FIFO_MODE (Bitfield-Mask: 0x01)             */
#define GPDMA1_CH_CFGH_PROTCTL_Pos            (2UL)                     /*!< GPDMA1_CH CFGH: PROTCTL (Bit 2)                             */
#define GPDMA1_CH_CFGH_PROTCTL_Msk            (0x1cUL)                  /*!< GPDMA1_CH CFGH: PROTCTL (Bitfield-Mask: 0x07)               */
#define GPDMA1_CH_CFGH_SRC_PER_Pos            (7UL)                     /*!< GPDMA1_CH CFGH: SRC_PER (Bit 7)                             */
#define GPDMA1_CH_CFGH_SRC_PER_Msk            (0x780UL)                 /*!< GPDMA1_CH CFGH: SRC_PER (Bitfield-Mask: 0x0f)               */
#define GPDMA1_CH_CFGH_DEST_PER_Pos           (11UL)                    /*!< GPDMA1_CH CFGH: DEST_PER (Bit 11)                           */
#define GPDMA1_CH_CFGH_DEST_PER_Msk           (0x7800UL)                /*!< GPDMA1_CH CFGH: DEST_PER (Bitfield-Mask: 0x0f)              */


/* ================================================================================ */
/* ================          struct 'FCE' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  FCE_CLC  ---------------------------------- */
#define FCE_CLC_DISR_Pos                      (0UL)                     /*!< FCE CLC: DISR (Bit 0)                                       */
#define FCE_CLC_DISR_Msk                      (0x1UL)                   /*!< FCE CLC: DISR (Bitfield-Mask: 0x01)                         */
#define FCE_CLC_DISS_Pos                      (1UL)                     /*!< FCE CLC: DISS (Bit 1)                                       */
#define FCE_CLC_DISS_Msk                      (0x2UL)                   /*!< FCE CLC: DISS (Bitfield-Mask: 0x01)                         */

