MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4700-F100K2048/mcu.h
/* ----------------------------  USB_GRXSTSP_HOSTMODE  ---------------------------- */
#define USB_GRXSTSP_HOSTMODE_ChNum_Pos        (0UL)                     /*!< USB GRXSTSP_HOSTMODE: ChNum (Bit 0)                         */
#define USB_GRXSTSP_HOSTMODE_ChNum_Msk        (0xfUL)                   /*!< USB GRXSTSP_HOSTMODE: ChNum (Bitfield-Mask: 0x0f)           */
#define USB_GRXSTSP_HOSTMODE_BCnt_Pos         (4UL)                     /*!< USB GRXSTSP_HOSTMODE: BCnt (Bit 4)                          */
#define USB_GRXSTSP_HOSTMODE_BCnt_Msk         (0x7ff0UL)                /*!< USB GRXSTSP_HOSTMODE: BCnt (Bitfield-Mask: 0x7ff)           */
#define USB_GRXSTSP_HOSTMODE_DPID_Pos         (15UL)                    /*!< USB GRXSTSP_HOSTMODE: DPID (Bit 15)                         */
#define USB_GRXSTSP_HOSTMODE_DPID_Msk         (0x18000UL)               /*!< USB GRXSTSP_HOSTMODE: DPID (Bitfield-Mask: 0x03)            */
#define USB_GRXSTSP_HOSTMODE_PktSts_Pos       (17UL)                    /*!< USB GRXSTSP_HOSTMODE: PktSts (Bit 17)                       */
#define USB_GRXSTSP_HOSTMODE_PktSts_Msk       (0x1e0000UL)              /*!< USB GRXSTSP_HOSTMODE: PktSts (Bitfield-Mask: 0x0f)          */

/* ---------------------------------  USB_GRXFSIZ  -------------------------------- */
#define USB_GRXFSIZ_RxFDep_Pos                (0UL)                     /*!< USB GRXFSIZ: RxFDep (Bit 0)                                 */
#define USB_GRXFSIZ_RxFDep_Msk                (0xffffUL)                /*!< USB GRXFSIZ: RxFDep (Bitfield-Mask: 0xffff)                 */

/* ---------------------------  USB_GNPTXFSIZ_HOSTMODE  --------------------------- */
#define USB_GNPTXFSIZ_HOSTMODE_NPTxFStAddr_Pos (0UL)                    /*!< USB GNPTXFSIZ_HOSTMODE: NPTxFStAddr (Bit 0)                 */
#define USB_GNPTXFSIZ_HOSTMODE_NPTxFStAddr_Msk (0xffffUL)               /*!< USB GNPTXFSIZ_HOSTMODE: NPTxFStAddr (Bitfield-Mask: 0xffff) */
#define USB_GNPTXFSIZ_HOSTMODE_NPTxFDep_Pos   (16UL)                    /*!< USB GNPTXFSIZ_HOSTMODE: NPTxFDep (Bit 16)                   */
#define USB_GNPTXFSIZ_HOSTMODE_NPTxFDep_Msk   (0xffff0000UL)            /*!< USB GNPTXFSIZ_HOSTMODE: NPTxFDep (Bitfield-Mask: 0xffff)    */

/* --------------------------  USB_GNPTXFSIZ_DEVICEMODE  -------------------------- */
#define USB_GNPTXFSIZ_DEVICEMODE_INEPTxF0StAddr_Pos (0UL)               /*!< USB GNPTXFSIZ_DEVICEMODE: INEPTxF0StAddr (Bit 0)            */
#define USB_GNPTXFSIZ_DEVICEMODE_INEPTxF0StAddr_Msk (0xffffUL)          /*!< USB GNPTXFSIZ_DEVICEMODE: INEPTxF0StAddr (Bitfield-Mask: 0xffff) */
#define USB_GNPTXFSIZ_DEVICEMODE_INEPTxF0Dep_Pos (16UL)                 /*!< USB GNPTXFSIZ_DEVICEMODE: INEPTxF0Dep (Bit 16)              */
#define USB_GNPTXFSIZ_DEVICEMODE_INEPTxF0Dep_Msk (0xffff0000UL)         /*!< USB GNPTXFSIZ_DEVICEMODE: INEPTxF0Dep (Bitfield-Mask: 0xffff) */

/* --------------------------------  USB_GNPTXSTS  -------------------------------- */
#define USB_GNPTXSTS_NPTxFSpcAvail_Pos        (0UL)                     /*!< USB GNPTXSTS: NPTxFSpcAvail (Bit 0)                         */
#define USB_GNPTXSTS_NPTxFSpcAvail_Msk        (0xffffUL)                /*!< USB GNPTXSTS: NPTxFSpcAvail (Bitfield-Mask: 0xffff)         */
#define USB_GNPTXSTS_NPTxQSpcAvail_Pos        (16UL)                    /*!< USB GNPTXSTS: NPTxQSpcAvail (Bit 16)                        */
#define USB_GNPTXSTS_NPTxQSpcAvail_Msk        (0xff0000UL)              /*!< USB GNPTXSTS: NPTxQSpcAvail (Bitfield-Mask: 0xff)           */
#define USB_GNPTXSTS_NPTxQTop_Pos             (24UL)                    /*!< USB GNPTXSTS: NPTxQTop (Bit 24)                             */
#define USB_GNPTXSTS_NPTxQTop_Msk             (0x7f000000UL)            /*!< USB GNPTXSTS: NPTxQTop (Bitfield-Mask: 0x7f)                */

/* ----------------------------------  USB_GUID  ---------------------------------- */
#define USB_GUID_MOD_REV_Pos                  (0UL)                     /*!< USB GUID: MOD_REV (Bit 0)                                   */
#define USB_GUID_MOD_REV_Msk                  (0xffUL)                  /*!< USB GUID: MOD_REV (Bitfield-Mask: 0xff)                     */
#define USB_GUID_MOD_TYPE_Pos                 (8UL)                     /*!< USB GUID: MOD_TYPE (Bit 8)                                  */
#define USB_GUID_MOD_TYPE_Msk                 (0xff00UL)                /*!< USB GUID: MOD_TYPE (Bitfield-Mask: 0xff)                    */
#define USB_GUID_MOD_NUMBER_Pos               (16UL)                    /*!< USB GUID: MOD_NUMBER (Bit 16)                               */
#define USB_GUID_MOD_NUMBER_Msk               (0xffff0000UL)            /*!< USB GUID: MOD_NUMBER (Bitfield-Mask: 0xffff)                */

/* --------------------------------  USB_GDFIFOCFG  ------------------------------- */
#define USB_GDFIFOCFG_GDFIFOCfg_Pos           (0UL)                     /*!< USB GDFIFOCFG: GDFIFOCfg (Bit 0)                            */
#define USB_GDFIFOCFG_GDFIFOCfg_Msk           (0xffffUL)                /*!< USB GDFIFOCFG: GDFIFOCfg (Bitfield-Mask: 0xffff)            */
#define USB_GDFIFOCFG_EPInfoBaseAddr_Pos      (16UL)                    /*!< USB GDFIFOCFG: EPInfoBaseAddr (Bit 16)                      */
#define USB_GDFIFOCFG_EPInfoBaseAddr_Msk      (0xffff0000UL)            /*!< USB GDFIFOCFG: EPInfoBaseAddr (Bitfield-Mask: 0xffff)       */

/* --------------------------------  USB_HPTXFSIZ  -------------------------------- */
#define USB_HPTXFSIZ_PTxFStAddr_Pos           (0UL)                     /*!< USB HPTXFSIZ: PTxFStAddr (Bit 0)                            */
#define USB_HPTXFSIZ_PTxFStAddr_Msk           (0xffffUL)                /*!< USB HPTXFSIZ: PTxFStAddr (Bitfield-Mask: 0xffff)            */
#define USB_HPTXFSIZ_PTxFSize_Pos             (16UL)                    /*!< USB HPTXFSIZ: PTxFSize (Bit 16)                             */
#define USB_HPTXFSIZ_PTxFSize_Msk             (0xffff0000UL)            /*!< USB HPTXFSIZ: PTxFSize (Bitfield-Mask: 0xffff)              */

/* --------------------------------  USB_DIEPTXF1  -------------------------------- */
#define USB_DIEPTXF1_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF1: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF1_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF1: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF1_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF1: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF1_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF1: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF2  -------------------------------- */
#define USB_DIEPTXF2_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF2: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF2_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF2: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF2_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF2: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF2_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF2: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

