MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4700-F100K2048/mcu.h
/* ---------------------------------  PORT5_IOCR0  -------------------------------- */
#define PORT5_IOCR0_PC0_Pos                   (3UL)                     /*!< PORT5 IOCR0: PC0 (Bit 3)                                    */
#define PORT5_IOCR0_PC0_Msk                   (0xf8UL)                  /*!< PORT5 IOCR0: PC0 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR0_PC1_Pos                   (11UL)                    /*!< PORT5 IOCR0: PC1 (Bit 11)                                   */
#define PORT5_IOCR0_PC1_Msk                   (0xf800UL)                /*!< PORT5 IOCR0: PC1 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR0_PC2_Pos                   (19UL)                    /*!< PORT5 IOCR0: PC2 (Bit 19)                                   */
#define PORT5_IOCR0_PC2_Msk                   (0xf80000UL)              /*!< PORT5 IOCR0: PC2 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR0_PC3_Pos                   (27UL)                    /*!< PORT5 IOCR0: PC3 (Bit 27)                                   */
#define PORT5_IOCR0_PC3_Msk                   (0xf8000000UL)            /*!< PORT5 IOCR0: PC3 (Bitfield-Mask: 0x1f)                      */

/* ---------------------------------  PORT5_IOCR4  -------------------------------- */
#define PORT5_IOCR4_PC4_Pos                   (3UL)                     /*!< PORT5 IOCR4: PC4 (Bit 3)                                    */
#define PORT5_IOCR4_PC4_Msk                   (0xf8UL)                  /*!< PORT5 IOCR4: PC4 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR4_PC5_Pos                   (11UL)                    /*!< PORT5 IOCR4: PC5 (Bit 11)                                   */
#define PORT5_IOCR4_PC5_Msk                   (0xf800UL)                /*!< PORT5 IOCR4: PC5 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR4_PC6_Pos                   (19UL)                    /*!< PORT5 IOCR4: PC6 (Bit 19)                                   */
#define PORT5_IOCR4_PC6_Msk                   (0xf80000UL)              /*!< PORT5 IOCR4: PC6 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR4_PC7_Pos                   (27UL)                    /*!< PORT5 IOCR4: PC7 (Bit 27)                                   */
#define PORT5_IOCR4_PC7_Msk                   (0xf8000000UL)            /*!< PORT5 IOCR4: PC7 (Bitfield-Mask: 0x1f)                      */

/* ---------------------------------  PORT5_IOCR8  -------------------------------- */
#define PORT5_IOCR8_PC8_Pos                   (3UL)                     /*!< PORT5 IOCR8: PC8 (Bit 3)                                    */
#define PORT5_IOCR8_PC8_Msk                   (0xf8UL)                  /*!< PORT5 IOCR8: PC8 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR8_PC9_Pos                   (11UL)                    /*!< PORT5 IOCR8: PC9 (Bit 11)                                   */
#define PORT5_IOCR8_PC9_Msk                   (0xf800UL)                /*!< PORT5 IOCR8: PC9 (Bitfield-Mask: 0x1f)                      */
#define PORT5_IOCR8_PC10_Pos                  (19UL)                    /*!< PORT5 IOCR8: PC10 (Bit 19)                                  */
#define PORT5_IOCR8_PC10_Msk                  (0xf80000UL)              /*!< PORT5 IOCR8: PC10 (Bitfield-Mask: 0x1f)                     */
#define PORT5_IOCR8_PC11_Pos                  (27UL)                    /*!< PORT5 IOCR8: PC11 (Bit 27)                                  */
#define PORT5_IOCR8_PC11_Msk                  (0xf8000000UL)            /*!< PORT5 IOCR8: PC11 (Bitfield-Mask: 0x1f)                     */

/* ----------------------------------  PORT5_IN  ---------------------------------- */
#define PORT5_IN_P0_Pos                       (0UL)                     /*!< PORT5 IN: P0 (Bit 0)                                        */
#define PORT5_IN_P0_Msk                       (0x1UL)                   /*!< PORT5 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P1_Pos                       (1UL)                     /*!< PORT5 IN: P1 (Bit 1)                                        */
#define PORT5_IN_P1_Msk                       (0x2UL)                   /*!< PORT5 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P2_Pos                       (2UL)                     /*!< PORT5 IN: P2 (Bit 2)                                        */
#define PORT5_IN_P2_Msk                       (0x4UL)                   /*!< PORT5 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P3_Pos                       (3UL)                     /*!< PORT5 IN: P3 (Bit 3)                                        */
#define PORT5_IN_P3_Msk                       (0x8UL)                   /*!< PORT5 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P4_Pos                       (4UL)                     /*!< PORT5 IN: P4 (Bit 4)                                        */
#define PORT5_IN_P4_Msk                       (0x10UL)                  /*!< PORT5 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P5_Pos                       (5UL)                     /*!< PORT5 IN: P5 (Bit 5)                                        */
#define PORT5_IN_P5_Msk                       (0x20UL)                  /*!< PORT5 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P6_Pos                       (6UL)                     /*!< PORT5 IN: P6 (Bit 6)                                        */
#define PORT5_IN_P6_Msk                       (0x40UL)                  /*!< PORT5 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P7_Pos                       (7UL)                     /*!< PORT5 IN: P7 (Bit 7)                                        */
#define PORT5_IN_P7_Msk                       (0x80UL)                  /*!< PORT5 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P8_Pos                       (8UL)                     /*!< PORT5 IN: P8 (Bit 8)                                        */
#define PORT5_IN_P8_Msk                       (0x100UL)                 /*!< PORT5 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P9_Pos                       (9UL)                     /*!< PORT5 IN: P9 (Bit 9)                                        */
#define PORT5_IN_P9_Msk                       (0x200UL)                 /*!< PORT5 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT5_IN_P10_Pos                      (10UL)                    /*!< PORT5 IN: P10 (Bit 10)                                      */
#define PORT5_IN_P10_Msk                      (0x400UL)                 /*!< PORT5 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT5_IN_P11_Pos                      (11UL)                    /*!< PORT5 IN: P11 (Bit 11)                                      */
#define PORT5_IN_P11_Msk                      (0x800UL)                 /*!< PORT5 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT5_IN_P12_Pos                      (12UL)                    /*!< PORT5 IN: P12 (Bit 12)                                      */
#define PORT5_IN_P12_Msk                      (0x1000UL)                /*!< PORT5 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT5_IN_P13_Pos                      (13UL)                    /*!< PORT5 IN: P13 (Bit 13)                                      */
#define PORT5_IN_P13_Msk                      (0x2000UL)                /*!< PORT5 IN: P13 (Bitfield-Mask: 0x01)                         */
#define PORT5_IN_P14_Pos                      (14UL)                    /*!< PORT5 IN: P14 (Bit 14)                                      */
#define PORT5_IN_P14_Msk                      (0x4000UL)                /*!< PORT5 IN: P14 (Bitfield-Mask: 0x01)                         */
#define PORT5_IN_P15_Pos                      (15UL)                    /*!< PORT5 IN: P15 (Bit 15)                                      */
#define PORT5_IN_P15_Msk                      (0x8000UL)                /*!< PORT5 IN: P15 (Bitfield-Mask: 0x01)                         */

/* ---------------------------------  PORT5_PDR0  --------------------------------- */
#define PORT5_PDR0_PD0_Pos                    (0UL)                     /*!< PORT5 PDR0: PD0 (Bit 0)                                     */
#define PORT5_PDR0_PD0_Msk                    (0x7UL)                   /*!< PORT5 PDR0: PD0 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD1_Pos                    (4UL)                     /*!< PORT5 PDR0: PD1 (Bit 4)                                     */
#define PORT5_PDR0_PD1_Msk                    (0x70UL)                  /*!< PORT5 PDR0: PD1 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD2_Pos                    (8UL)                     /*!< PORT5 PDR0: PD2 (Bit 8)                                     */
#define PORT5_PDR0_PD2_Msk                    (0x700UL)                 /*!< PORT5 PDR0: PD2 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD3_Pos                    (12UL)                    /*!< PORT5 PDR0: PD3 (Bit 12)                                    */
#define PORT5_PDR0_PD3_Msk                    (0x7000UL)                /*!< PORT5 PDR0: PD3 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD4_Pos                    (16UL)                    /*!< PORT5 PDR0: PD4 (Bit 16)                                    */
#define PORT5_PDR0_PD4_Msk                    (0x70000UL)               /*!< PORT5 PDR0: PD4 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD5_Pos                    (20UL)                    /*!< PORT5 PDR0: PD5 (Bit 20)                                    */
#define PORT5_PDR0_PD5_Msk                    (0x700000UL)              /*!< PORT5 PDR0: PD5 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD6_Pos                    (24UL)                    /*!< PORT5 PDR0: PD6 (Bit 24)                                    */
#define PORT5_PDR0_PD6_Msk                    (0x7000000UL)             /*!< PORT5 PDR0: PD6 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR0_PD7_Pos                    (28UL)                    /*!< PORT5 PDR0: PD7 (Bit 28)                                    */
#define PORT5_PDR0_PD7_Msk                    (0x70000000UL)            /*!< PORT5 PDR0: PD7 (Bitfield-Mask: 0x07)                       */

/* ---------------------------------  PORT5_PDR1  --------------------------------- */
#define PORT5_PDR1_PD8_Pos                    (0UL)                     /*!< PORT5 PDR1: PD8 (Bit 0)                                     */
#define PORT5_PDR1_PD8_Msk                    (0x7UL)                   /*!< PORT5 PDR1: PD8 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR1_PD9_Pos                    (4UL)                     /*!< PORT5 PDR1: PD9 (Bit 4)                                     */
#define PORT5_PDR1_PD9_Msk                    (0x70UL)                  /*!< PORT5 PDR1: PD9 (Bitfield-Mask: 0x07)                       */
#define PORT5_PDR1_PD10_Pos                   (8UL)                     /*!< PORT5 PDR1: PD10 (Bit 8)                                    */
#define PORT5_PDR1_PD10_Msk                   (0x700UL)                 /*!< PORT5 PDR1: PD10 (Bitfield-Mask: 0x07)                      */
#define PORT5_PDR1_PD11_Pos                   (12UL)                    /*!< PORT5 PDR1: PD11 (Bit 12)                                   */
#define PORT5_PDR1_PD11_Msk                   (0x7000UL)                /*!< PORT5 PDR1: PD11 (Bitfield-Mask: 0x07)                      */
#define PORT5_PDR1_PD12_Pos                   (16UL)                    /*!< PORT5 PDR1: PD12 (Bit 16)                                   */
#define PORT5_PDR1_PD12_Msk                   (0x70000UL)               /*!< PORT5 PDR1: PD12 (Bitfield-Mask: 0x07)                      */
#define PORT5_PDR1_PD13_Pos                   (20UL)                    /*!< PORT5 PDR1: PD13 (Bit 20)                                   */
#define PORT5_PDR1_PD13_Msk                   (0x700000UL)              /*!< PORT5 PDR1: PD13 (Bitfield-Mask: 0x07)                      */
#define PORT5_PDR1_PD14_Pos                   (24UL)                    /*!< PORT5 PDR1: PD14 (Bit 24)                                   */
#define PORT5_PDR1_PD14_Msk                   (0x7000000UL)             /*!< PORT5 PDR1: PD14 (Bitfield-Mask: 0x07)                      */
#define PORT5_PDR1_PD15_Pos                   (28UL)                    /*!< PORT5 PDR1: PD15 (Bit 28)                                   */
#define PORT5_PDR1_PD15_Msk                   (0x70000000UL)            /*!< PORT5 PDR1: PD15 (Bitfield-Mask: 0x07)                      */

/* ---------------------------------  PORT5_PDISC  -------------------------------- */
#define PORT5_PDISC_PDIS0_Pos                 (0UL)                     /*!< PORT5 PDISC: PDIS0 (Bit 0)                                  */
#define PORT5_PDISC_PDIS0_Msk                 (0x1UL)                   /*!< PORT5 PDISC: PDIS0 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS1_Pos                 (1UL)                     /*!< PORT5 PDISC: PDIS1 (Bit 1)                                  */
#define PORT5_PDISC_PDIS1_Msk                 (0x2UL)                   /*!< PORT5 PDISC: PDIS1 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS2_Pos                 (2UL)                     /*!< PORT5 PDISC: PDIS2 (Bit 2)                                  */
#define PORT5_PDISC_PDIS2_Msk                 (0x4UL)                   /*!< PORT5 PDISC: PDIS2 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS3_Pos                 (3UL)                     /*!< PORT5 PDISC: PDIS3 (Bit 3)                                  */
#define PORT5_PDISC_PDIS3_Msk                 (0x8UL)                   /*!< PORT5 PDISC: PDIS3 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS4_Pos                 (4UL)                     /*!< PORT5 PDISC: PDIS4 (Bit 4)                                  */
#define PORT5_PDISC_PDIS4_Msk                 (0x10UL)                  /*!< PORT5 PDISC: PDIS4 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS5_Pos                 (5UL)                     /*!< PORT5 PDISC: PDIS5 (Bit 5)                                  */
#define PORT5_PDISC_PDIS5_Msk                 (0x20UL)                  /*!< PORT5 PDISC: PDIS5 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS6_Pos                 (6UL)                     /*!< PORT5 PDISC: PDIS6 (Bit 6)                                  */
#define PORT5_PDISC_PDIS6_Msk                 (0x40UL)                  /*!< PORT5 PDISC: PDIS6 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS7_Pos                 (7UL)                     /*!< PORT5 PDISC: PDIS7 (Bit 7)                                  */
#define PORT5_PDISC_PDIS7_Msk                 (0x80UL)                  /*!< PORT5 PDISC: PDIS7 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS8_Pos                 (8UL)                     /*!< PORT5 PDISC: PDIS8 (Bit 8)                                  */
#define PORT5_PDISC_PDIS8_Msk                 (0x100UL)                 /*!< PORT5 PDISC: PDIS8 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS9_Pos                 (9UL)                     /*!< PORT5 PDISC: PDIS9 (Bit 9)                                  */
#define PORT5_PDISC_PDIS9_Msk                 (0x200UL)                 /*!< PORT5 PDISC: PDIS9 (Bitfield-Mask: 0x01)                    */
#define PORT5_PDISC_PDIS10_Pos                (10UL)                    /*!< PORT5 PDISC: PDIS10 (Bit 10)                                */
#define PORT5_PDISC_PDIS10_Msk                (0x400UL)                 /*!< PORT5 PDISC: PDIS10 (Bitfield-Mask: 0x01)                   */
#define PORT5_PDISC_PDIS11_Pos                (11UL)                    /*!< PORT5 PDISC: PDIS11 (Bit 11)                                */
#define PORT5_PDISC_PDIS11_Msk                (0x800UL)                 /*!< PORT5 PDISC: PDIS11 (Bitfield-Mask: 0x01)                   */
#define PORT5_PDISC_PDIS12_Pos                (12UL)                    /*!< PORT5 PDISC: PDIS12 (Bit 12)                                */
#define PORT5_PDISC_PDIS12_Msk                (0x1000UL)                /*!< PORT5 PDISC: PDIS12 (Bitfield-Mask: 0x01)                   */
#define PORT5_PDISC_PDIS13_Pos                (13UL)                    /*!< PORT5 PDISC: PDIS13 (Bit 13)                                */
#define PORT5_PDISC_PDIS13_Msk                (0x2000UL)                /*!< PORT5 PDISC: PDIS13 (Bitfield-Mask: 0x01)                   */
#define PORT5_PDISC_PDIS14_Pos                (14UL)                    /*!< PORT5 PDISC: PDIS14 (Bit 14)                                */
#define PORT5_PDISC_PDIS14_Msk                (0x4000UL)                /*!< PORT5 PDISC: PDIS14 (Bitfield-Mask: 0x01)                   */
#define PORT5_PDISC_PDIS15_Pos                (15UL)                    /*!< PORT5 PDISC: PDIS15 (Bit 15)                                */
#define PORT5_PDISC_PDIS15_Msk                (0x8000UL)                /*!< PORT5 PDISC: PDIS15 (Bitfield-Mask: 0x01)                   */

/* ----------------------------------  PORT5_PPS  --------------------------------- */
#define PORT5_PPS_PPS0_Pos                    (0UL)                     /*!< PORT5 PPS: PPS0 (Bit 0)                                     */
#define PORT5_PPS_PPS0_Msk                    (0x1UL)                   /*!< PORT5 PPS: PPS0 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS1_Pos                    (1UL)                     /*!< PORT5 PPS: PPS1 (Bit 1)                                     */
#define PORT5_PPS_PPS1_Msk                    (0x2UL)                   /*!< PORT5 PPS: PPS1 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS2_Pos                    (2UL)                     /*!< PORT5 PPS: PPS2 (Bit 2)                                     */
#define PORT5_PPS_PPS2_Msk                    (0x4UL)                   /*!< PORT5 PPS: PPS2 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS3_Pos                    (3UL)                     /*!< PORT5 PPS: PPS3 (Bit 3)                                     */
#define PORT5_PPS_PPS3_Msk                    (0x8UL)                   /*!< PORT5 PPS: PPS3 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS4_Pos                    (4UL)                     /*!< PORT5 PPS: PPS4 (Bit 4)                                     */
#define PORT5_PPS_PPS4_Msk                    (0x10UL)                  /*!< PORT5 PPS: PPS4 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS5_Pos                    (5UL)                     /*!< PORT5 PPS: PPS5 (Bit 5)                                     */
#define PORT5_PPS_PPS5_Msk                    (0x20UL)                  /*!< PORT5 PPS: PPS5 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS6_Pos                    (6UL)                     /*!< PORT5 PPS: PPS6 (Bit 6)                                     */
#define PORT5_PPS_PPS6_Msk                    (0x40UL)                  /*!< PORT5 PPS: PPS6 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS7_Pos                    (7UL)                     /*!< PORT5 PPS: PPS7 (Bit 7)                                     */
#define PORT5_PPS_PPS7_Msk                    (0x80UL)                  /*!< PORT5 PPS: PPS7 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS8_Pos                    (8UL)                     /*!< PORT5 PPS: PPS8 (Bit 8)                                     */
#define PORT5_PPS_PPS8_Msk                    (0x100UL)                 /*!< PORT5 PPS: PPS8 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS9_Pos                    (9UL)                     /*!< PORT5 PPS: PPS9 (Bit 9)                                     */
#define PORT5_PPS_PPS9_Msk                    (0x200UL)                 /*!< PORT5 PPS: PPS9 (Bitfield-Mask: 0x01)                       */
#define PORT5_PPS_PPS10_Pos                   (10UL)                    /*!< PORT5 PPS: PPS10 (Bit 10)                                   */
#define PORT5_PPS_PPS10_Msk                   (0x400UL)                 /*!< PORT5 PPS: PPS10 (Bitfield-Mask: 0x01)                      */
#define PORT5_PPS_PPS11_Pos                   (11UL)                    /*!< PORT5 PPS: PPS11 (Bit 11)                                   */
#define PORT5_PPS_PPS11_Msk                   (0x800UL)                 /*!< PORT5 PPS: PPS11 (Bitfield-Mask: 0x01)                      */
#define PORT5_PPS_PPS12_Pos                   (12UL)                    /*!< PORT5 PPS: PPS12 (Bit 12)                                   */
#define PORT5_PPS_PPS12_Msk                   (0x1000UL)                /*!< PORT5 PPS: PPS12 (Bitfield-Mask: 0x01)                      */
#define PORT5_PPS_PPS13_Pos                   (13UL)                    /*!< PORT5 PPS: PPS13 (Bit 13)                                   */
#define PORT5_PPS_PPS13_Msk                   (0x2000UL)                /*!< PORT5 PPS: PPS13 (Bitfield-Mask: 0x01)                      */
#define PORT5_PPS_PPS14_Pos                   (14UL)                    /*!< PORT5 PPS: PPS14 (Bit 14)                                   */
#define PORT5_PPS_PPS14_Msk                   (0x4000UL)                /*!< PORT5 PPS: PPS14 (Bitfield-Mask: 0x01)                      */
#define PORT5_PPS_PPS15_Pos                   (15UL)                    /*!< PORT5 PPS: PPS15 (Bit 15)                                   */
#define PORT5_PPS_PPS15_Msk                   (0x8000UL)                /*!< PORT5 PPS: PPS15 (Bitfield-Mask: 0x01)                      */

