MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4700-F100K2048/mcu.h
/* --------------------------------  PORT14_PDISC  -------------------------------- */
#define PORT14_PDISC_PDIS0_Pos                (0UL)                     /*!< PORT14 PDISC: PDIS0 (Bit 0)                                 */
#define PORT14_PDISC_PDIS0_Msk                (0x1UL)                   /*!< PORT14 PDISC: PDIS0 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS1_Pos                (1UL)                     /*!< PORT14 PDISC: PDIS1 (Bit 1)                                 */
#define PORT14_PDISC_PDIS1_Msk                (0x2UL)                   /*!< PORT14 PDISC: PDIS1 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS2_Pos                (2UL)                     /*!< PORT14 PDISC: PDIS2 (Bit 2)                                 */
#define PORT14_PDISC_PDIS2_Msk                (0x4UL)                   /*!< PORT14 PDISC: PDIS2 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS3_Pos                (3UL)                     /*!< PORT14 PDISC: PDIS3 (Bit 3)                                 */
#define PORT14_PDISC_PDIS3_Msk                (0x8UL)                   /*!< PORT14 PDISC: PDIS3 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS4_Pos                (4UL)                     /*!< PORT14 PDISC: PDIS4 (Bit 4)                                 */
#define PORT14_PDISC_PDIS4_Msk                (0x10UL)                  /*!< PORT14 PDISC: PDIS4 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS5_Pos                (5UL)                     /*!< PORT14 PDISC: PDIS5 (Bit 5)                                 */
#define PORT14_PDISC_PDIS5_Msk                (0x20UL)                  /*!< PORT14 PDISC: PDIS5 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS6_Pos                (6UL)                     /*!< PORT14 PDISC: PDIS6 (Bit 6)                                 */
#define PORT14_PDISC_PDIS6_Msk                (0x40UL)                  /*!< PORT14 PDISC: PDIS6 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS7_Pos                (7UL)                     /*!< PORT14 PDISC: PDIS7 (Bit 7)                                 */
#define PORT14_PDISC_PDIS7_Msk                (0x80UL)                  /*!< PORT14 PDISC: PDIS7 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS8_Pos                (8UL)                     /*!< PORT14 PDISC: PDIS8 (Bit 8)                                 */
#define PORT14_PDISC_PDIS8_Msk                (0x100UL)                 /*!< PORT14 PDISC: PDIS8 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS9_Pos                (9UL)                     /*!< PORT14 PDISC: PDIS9 (Bit 9)                                 */
#define PORT14_PDISC_PDIS9_Msk                (0x200UL)                 /*!< PORT14 PDISC: PDIS9 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS12_Pos               (12UL)                    /*!< PORT14 PDISC: PDIS12 (Bit 12)                               */
#define PORT14_PDISC_PDIS12_Msk               (0x1000UL)                /*!< PORT14 PDISC: PDIS12 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS13_Pos               (13UL)                    /*!< PORT14 PDISC: PDIS13 (Bit 13)                               */
#define PORT14_PDISC_PDIS13_Msk               (0x2000UL)                /*!< PORT14 PDISC: PDIS13 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS14_Pos               (14UL)                    /*!< PORT14 PDISC: PDIS14 (Bit 14)                               */
#define PORT14_PDISC_PDIS14_Msk               (0x4000UL)                /*!< PORT14 PDISC: PDIS14 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS15_Pos               (15UL)                    /*!< PORT14 PDISC: PDIS15 (Bit 15)                               */
#define PORT14_PDISC_PDIS15_Msk               (0x8000UL)                /*!< PORT14 PDISC: PDIS15 (Bitfield-Mask: 0x01)                  */

/* ---------------------------------  PORT14_PPS  --------------------------------- */
#define PORT14_PPS_PPS0_Pos                   (0UL)                     /*!< PORT14 PPS: PPS0 (Bit 0)                                    */
#define PORT14_PPS_PPS0_Msk                   (0x1UL)                   /*!< PORT14 PPS: PPS0 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS1_Pos                   (1UL)                     /*!< PORT14 PPS: PPS1 (Bit 1)                                    */
#define PORT14_PPS_PPS1_Msk                   (0x2UL)                   /*!< PORT14 PPS: PPS1 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS2_Pos                   (2UL)                     /*!< PORT14 PPS: PPS2 (Bit 2)                                    */
#define PORT14_PPS_PPS2_Msk                   (0x4UL)                   /*!< PORT14 PPS: PPS2 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS3_Pos                   (3UL)                     /*!< PORT14 PPS: PPS3 (Bit 3)                                    */
#define PORT14_PPS_PPS3_Msk                   (0x8UL)                   /*!< PORT14 PPS: PPS3 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS4_Pos                   (4UL)                     /*!< PORT14 PPS: PPS4 (Bit 4)                                    */
#define PORT14_PPS_PPS4_Msk                   (0x10UL)                  /*!< PORT14 PPS: PPS4 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS5_Pos                   (5UL)                     /*!< PORT14 PPS: PPS5 (Bit 5)                                    */
#define PORT14_PPS_PPS5_Msk                   (0x20UL)                  /*!< PORT14 PPS: PPS5 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS6_Pos                   (6UL)                     /*!< PORT14 PPS: PPS6 (Bit 6)                                    */
#define PORT14_PPS_PPS6_Msk                   (0x40UL)                  /*!< PORT14 PPS: PPS6 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS7_Pos                   (7UL)                     /*!< PORT14 PPS: PPS7 (Bit 7)                                    */
#define PORT14_PPS_PPS7_Msk                   (0x80UL)                  /*!< PORT14 PPS: PPS7 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS8_Pos                   (8UL)                     /*!< PORT14 PPS: PPS8 (Bit 8)                                    */
#define PORT14_PPS_PPS8_Msk                   (0x100UL)                 /*!< PORT14 PPS: PPS8 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS9_Pos                   (9UL)                     /*!< PORT14 PPS: PPS9 (Bit 9)                                    */
#define PORT14_PPS_PPS9_Msk                   (0x200UL)                 /*!< PORT14 PPS: PPS9 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS10_Pos                  (10UL)                    /*!< PORT14 PPS: PPS10 (Bit 10)                                  */
#define PORT14_PPS_PPS10_Msk                  (0x400UL)                 /*!< PORT14 PPS: PPS10 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS11_Pos                  (11UL)                    /*!< PORT14 PPS: PPS11 (Bit 11)                                  */
#define PORT14_PPS_PPS11_Msk                  (0x800UL)                 /*!< PORT14 PPS: PPS11 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS12_Pos                  (12UL)                    /*!< PORT14 PPS: PPS12 (Bit 12)                                  */
#define PORT14_PPS_PPS12_Msk                  (0x1000UL)                /*!< PORT14 PPS: PPS12 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS13_Pos                  (13UL)                    /*!< PORT14 PPS: PPS13 (Bit 13)                                  */
#define PORT14_PPS_PPS13_Msk                  (0x2000UL)                /*!< PORT14 PPS: PPS13 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS14_Pos                  (14UL)                    /*!< PORT14 PPS: PPS14 (Bit 14)                                  */
#define PORT14_PPS_PPS14_Msk                  (0x4000UL)                /*!< PORT14 PPS: PPS14 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS15_Pos                  (15UL)                    /*!< PORT14 PPS: PPS15 (Bit 15)                                  */
#define PORT14_PPS_PPS15_Msk                  (0x8000UL)                /*!< PORT14 PPS: PPS15 (Bitfield-Mask: 0x01)                     */

/* --------------------------------  PORT14_HWSEL  -------------------------------- */
#define PORT14_HWSEL_HW0_Pos                  (0UL)                     /*!< PORT14 HWSEL: HW0 (Bit 0)                                   */
#define PORT14_HWSEL_HW0_Msk                  (0x3UL)                   /*!< PORT14 HWSEL: HW0 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW1_Pos                  (2UL)                     /*!< PORT14 HWSEL: HW1 (Bit 2)                                   */
#define PORT14_HWSEL_HW1_Msk                  (0xcUL)                   /*!< PORT14 HWSEL: HW1 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW2_Pos                  (4UL)                     /*!< PORT14 HWSEL: HW2 (Bit 4)                                   */
#define PORT14_HWSEL_HW2_Msk                  (0x30UL)                  /*!< PORT14 HWSEL: HW2 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW3_Pos                  (6UL)                     /*!< PORT14 HWSEL: HW3 (Bit 6)                                   */
#define PORT14_HWSEL_HW3_Msk                  (0xc0UL)                  /*!< PORT14 HWSEL: HW3 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW4_Pos                  (8UL)                     /*!< PORT14 HWSEL: HW4 (Bit 8)                                   */
#define PORT14_HWSEL_HW4_Msk                  (0x300UL)                 /*!< PORT14 HWSEL: HW4 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW5_Pos                  (10UL)                    /*!< PORT14 HWSEL: HW5 (Bit 10)                                  */
#define PORT14_HWSEL_HW5_Msk                  (0xc00UL)                 /*!< PORT14 HWSEL: HW5 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW6_Pos                  (12UL)                    /*!< PORT14 HWSEL: HW6 (Bit 12)                                  */
#define PORT14_HWSEL_HW6_Msk                  (0x3000UL)                /*!< PORT14 HWSEL: HW6 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW7_Pos                  (14UL)                    /*!< PORT14 HWSEL: HW7 (Bit 14)                                  */
#define PORT14_HWSEL_HW7_Msk                  (0xc000UL)                /*!< PORT14 HWSEL: HW7 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW8_Pos                  (16UL)                    /*!< PORT14 HWSEL: HW8 (Bit 16)                                  */
#define PORT14_HWSEL_HW8_Msk                  (0x30000UL)               /*!< PORT14 HWSEL: HW8 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW9_Pos                  (18UL)                    /*!< PORT14 HWSEL: HW9 (Bit 18)                                  */
#define PORT14_HWSEL_HW9_Msk                  (0xc0000UL)               /*!< PORT14 HWSEL: HW9 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW10_Pos                 (20UL)                    /*!< PORT14 HWSEL: HW10 (Bit 20)                                 */
#define PORT14_HWSEL_HW10_Msk                 (0x300000UL)              /*!< PORT14 HWSEL: HW10 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW11_Pos                 (22UL)                    /*!< PORT14 HWSEL: HW11 (Bit 22)                                 */
#define PORT14_HWSEL_HW11_Msk                 (0xc00000UL)              /*!< PORT14 HWSEL: HW11 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW12_Pos                 (24UL)                    /*!< PORT14 HWSEL: HW12 (Bit 24)                                 */
#define PORT14_HWSEL_HW12_Msk                 (0x3000000UL)             /*!< PORT14 HWSEL: HW12 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW13_Pos                 (26UL)                    /*!< PORT14 HWSEL: HW13 (Bit 26)                                 */
#define PORT14_HWSEL_HW13_Msk                 (0xc000000UL)             /*!< PORT14 HWSEL: HW13 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW14_Pos                 (28UL)                    /*!< PORT14 HWSEL: HW14 (Bit 28)                                 */
#define PORT14_HWSEL_HW14_Msk                 (0x30000000UL)            /*!< PORT14 HWSEL: HW14 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW15_Pos                 (30UL)                    /*!< PORT14 HWSEL: HW15 (Bit 30)                                 */
#define PORT14_HWSEL_HW15_Msk                 (0xc0000000UL)            /*!< PORT14 HWSEL: HW15 (Bitfield-Mask: 0x03)                    */


/* ================================================================================ */
/* ================         struct 'PORT15' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  PORT15_OUT  --------------------------------- */
#define PORT15_OUT_P0_Pos                     (0UL)                     /*!< PORT15 OUT: P0 (Bit 0)                                      */
#define PORT15_OUT_P0_Msk                     (0x1UL)                   /*!< PORT15 OUT: P0 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P1_Pos                     (1UL)                     /*!< PORT15 OUT: P1 (Bit 1)                                      */
#define PORT15_OUT_P1_Msk                     (0x2UL)                   /*!< PORT15 OUT: P1 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P2_Pos                     (2UL)                     /*!< PORT15 OUT: P2 (Bit 2)                                      */
#define PORT15_OUT_P2_Msk                     (0x4UL)                   /*!< PORT15 OUT: P2 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P3_Pos                     (3UL)                     /*!< PORT15 OUT: P3 (Bit 3)                                      */
#define PORT15_OUT_P3_Msk                     (0x8UL)                   /*!< PORT15 OUT: P3 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P4_Pos                     (4UL)                     /*!< PORT15 OUT: P4 (Bit 4)                                      */
#define PORT15_OUT_P4_Msk                     (0x10UL)                  /*!< PORT15 OUT: P4 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P5_Pos                     (5UL)                     /*!< PORT15 OUT: P5 (Bit 5)                                      */
#define PORT15_OUT_P5_Msk                     (0x20UL)                  /*!< PORT15 OUT: P5 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P6_Pos                     (6UL)                     /*!< PORT15 OUT: P6 (Bit 6)                                      */
#define PORT15_OUT_P6_Msk                     (0x40UL)                  /*!< PORT15 OUT: P6 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P7_Pos                     (7UL)                     /*!< PORT15 OUT: P7 (Bit 7)                                      */
#define PORT15_OUT_P7_Msk                     (0x80UL)                  /*!< PORT15 OUT: P7 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P8_Pos                     (8UL)                     /*!< PORT15 OUT: P8 (Bit 8)                                      */
#define PORT15_OUT_P8_Msk                     (0x100UL)                 /*!< PORT15 OUT: P8 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P9_Pos                     (9UL)                     /*!< PORT15 OUT: P9 (Bit 9)                                      */
#define PORT15_OUT_P9_Msk                     (0x200UL)                 /*!< PORT15 OUT: P9 (Bitfield-Mask: 0x01)                        */
#define PORT15_OUT_P10_Pos                    (10UL)                    /*!< PORT15 OUT: P10 (Bit 10)                                    */
#define PORT15_OUT_P10_Msk                    (0x400UL)                 /*!< PORT15 OUT: P10 (Bitfield-Mask: 0x01)                       */
#define PORT15_OUT_P11_Pos                    (11UL)                    /*!< PORT15 OUT: P11 (Bit 11)                                    */
#define PORT15_OUT_P11_Msk                    (0x800UL)                 /*!< PORT15 OUT: P11 (Bitfield-Mask: 0x01)                       */
#define PORT15_OUT_P12_Pos                    (12UL)                    /*!< PORT15 OUT: P12 (Bit 12)                                    */
#define PORT15_OUT_P12_Msk                    (0x1000UL)                /*!< PORT15 OUT: P12 (Bitfield-Mask: 0x01)                       */
#define PORT15_OUT_P13_Pos                    (13UL)                    /*!< PORT15 OUT: P13 (Bit 13)                                    */
#define PORT15_OUT_P13_Msk                    (0x2000UL)                /*!< PORT15 OUT: P13 (Bitfield-Mask: 0x01)                       */
#define PORT15_OUT_P14_Pos                    (14UL)                    /*!< PORT15 OUT: P14 (Bit 14)                                    */
#define PORT15_OUT_P14_Msk                    (0x4000UL)                /*!< PORT15 OUT: P14 (Bitfield-Mask: 0x01)                       */
#define PORT15_OUT_P15_Pos                    (15UL)                    /*!< PORT15 OUT: P15 (Bit 15)                                    */
#define PORT15_OUT_P15_Msk                    (0x8000UL)                /*!< PORT15 OUT: P15 (Bitfield-Mask: 0x01)                       */

